# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

tap 'utilitywarehouse/tap'
tap 'uw-labs/tap'

# Binaries
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'colima'
brew 'coreutils'
brew 'curl'
brew 'docker'
brew 'exa'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'go'
brew 'grep'
brew 'htop'
brew 'jq'
brew 'k9s'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kustomize'
brew 'mas'
brew 'nvm'
brew 'ripgrep'
brew 'starship'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

brew 'utilitywarehouse/tap/wiresteward'
brew 'uw-labs/tap/strongbox'

# Apps
cask '1password'
cask 'bartender'
cask 'iterm2'
cask 'google-chrome'
cask 'raycast'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'todoist'
cask 'visual-studio-code'

# Quicklook
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'

# Mac App Store
# mas 'Xcode', id: 497799835

