# Taps
tap 'namespacelabs/namespace'

# Binaries
brew 'bash'
brew 'bat'
brew 'buf'
brew 'ca-certificates'
brew 'coreutils'
brew 'curl'
brew 'direnv'
brew 'docker'
brew 'dust'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gpg'
brew 'graphviz'
brew 'grep'
brew 'htop'
brew 'jj'
brew 'jq'
brew 'k9s'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kustomize'
brew 'mas'
brew 'mise'
brew 'namespacelabs/namespace/nsc'
brew 'ripgrep'
brew 'starship'
brew 'tree'
brew 'tw93/tap/mole'
brew 'vim'
brew 'watch'
brew 'yq'
brew 'zoxide'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Apps
cask '1password'
cask 'claude-code'
cask 'discord'
cask 'ghostty'
cask 'google-chrome'
cask 'jordanbaird-ice'
cask 'linear-linear'
cask 'nvidia-geforce-now'
cask 'obsidian'
cask 'orbstack'
cask 'rapidapi'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'todoist-app'
cask 'visual-studio-code'

# Fonts
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'

# Mac App Store
# mas 'Xcode', id: 497799835
