# Taps
tap 'hashicorp/tap'

# Binaries
brew 'bash'
brew 'bat'
brew 'buf'
brew 'ca-certificates'
brew 'coreutils'
brew 'curl'
brew 'docker'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'go'
brew 'grep'
brew 'hashicorp/tap/terraform'
brew 'htop'
brew 'jq'
brew 'k9s'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kustomize'
brew 'mas'
brew 'nvm'
brew 'ripgrep'
brew 'semgrep'
brew 'starship'
brew 'temporal'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Apps
cask '1password'
cask 'ghostty'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'jordanbaird-ice'
cask 'orbstack'
cask 'rapidapi'
cask 'raycast'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'todoist'
cask 'visual-studio-code'

# Fonts
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'

# Mac App Store
mas 'Xcode', id: 497799835
